In [1]:
import pandas as pd
import numpy as np

# 索引參照屬性
- df.**at**: 使用 index (key) 和 columns **名稱** 來「取得或設定」單一元素內容或陣列內容。
- df.**iat**: 使用 index (key) 和 columns **編號** 來「取得或設定」單一元素內容。
- df.**loc**: 使用 index (key) 或 columns **名稱** 來「取得或設定」整個 row 或 columns 的資料或陣列內容。
- df.**iloc**: 使用 index (key) 或 columns **編號** 來「取得或設定」整個 row 或 columns 的資料。

In [2]:
'''建立「2020 ~ 2023」年「臺北、臺中、高雄」某月平均溫度 的 dataframe'''

# 建立欄位
years = range(2020, 2024)

# 臺北、臺中、高雄 某個月的平均溫度
taipei = pd.Series([20, 21, 19, 21], index=years)
taichung = pd.Series([25, 26, 27, 28], index=years)
kaohsiung = pd.Series([30, 29, 31, 32], index=years)

# 建立 dataframe (axis=0 是上下合併，axis=1 是左右合併)
df = pd.concat([taipei, taichung, kaohsiung], axis=1)

# 設定欄位
df.columns = ['taipei', 'taichung', 'kaohsiung']; df

      taipei  taichung  kaohsiung
2020      20        25         30
2021      21        26         29
2022      19        27         31
2023      21        28         32

In [3]:
# 使用 at: 取得 row 是 2020 且 column 是 taipei 的值
df.at[2020, 'taipei']

20

In [4]:
# 使用 at: 取得 row 是 2023 且 column 是 kaohsiung 的值
df.at[2023, 'kaohsiung']

32

In [5]:
# 使用 iat: 取得 row 是 2, column 是 1 的值
'''
index 是 zero-based
'''
df.iat[2, 1]

27

In [6]:
# 使用 loc: 取得 row 是 2021 的資料
'''
只有指定 2021，所以回傳 series 型態
'''
df.loc[2021]

taipei       21
taichung     26
kaohsiung    29
Name: 2021, dtype: int64

In [7]:
# 使用 loc: 取得 row 是 2020 和 2023 的資料
'''
指定兩個 row，資料將自帶 column，回傳 dataframe
'''
df.loc[ [2020, 2023] ]

      taipei  taichung  kaohsiung
2020      20        25         30
2023      21        28         32

In [8]:
# 使用 loc: 取得 row 是 2021 到 2023、column 是 taichung 到 kaohsiung 的資料
'''
沒有 slicing 有關 end 需要減 1 的問題
'''
df.loc[2021:2023, "taichung":"kaohsiung"]

      taichung  kaohsiung
2021        26         29
2022        27         31
2023        28         32

In [9]:
# 使用 iloc: 取得 row 是 0 的資料
'''
只有指定 [0]，所以回傳 series
'''
df.iloc[0]

taipei       20
taichung     25
kaohsiung    30
Name: 2020, dtype: int64

# 直接索引
不用使用 df.at\[\]、df.loc\[\] 等方式取得資料，直接使用 `df[index 或 key]`，來取得對應的行或列的資料。

In [10]:
# 取得 column 為 taipei 的資料
df['taipei']

2020    20
2021    21
2022    19
2023    21
Name: taipei, dtype: int64

In [11]:
# 取得 column 是 taipei、row 是 2022 的資料
df['taipei'][2022]

19

In [12]:
# 取得 column 是 taipei 和 taichung 的資料
df[ ['taipei', 'taichung'] ]

      taipei  taichung
2020      20        25
2021      21        26
2022      19        27
2023      21        28

In [13]:
# 取得 row 索引編號 1 ~ 2 的資料
'''
透過 slicing 方式取得資料
'''
df[1:3]

      taipei  taichung  kaohsiung
2021      21        26         29
2022      19        27         31

In [14]:
# 取得 row 索引編號 3 之前的資料
'''
透過 slicing 方式取得資料
'''
df[:3]

      taipei  taichung  kaohsiung
2020      20        25         30
2021      21        26         29
2022      19        27         31

In [15]:
# 取得 taipei 溫度大於 20 的資料
'''
類似在 df 索引位置進行邏輯判斷
'''
df[ df['taipei'] > 20 ]

      taipei  taichung  kaohsiung
2021      21        26         29
2023      21        28         32

In [16]:
# 取得 taipei 溫度大於 20、高雄溫度大於 30 的資料
'''
判斷陳述句，要用括號包起來

&: and
|: or
'''
df[ (df['taipei'] > 20) & (df['kaohsiung'] > 30) ]

      taipei  taichung  kaohsiung
2023      21        28         32

# 四則運算
- add(): 加法
- sub(): 減法
- mul(): 乘法
- div(): 除法

`註: series 跟 dataframe 都可以用`

In [17]:
# 初始化
df1 = pd.DataFrame([
    {'a': 15, 'b': 15}, 
    {'a': 12, 'b': 18}
])
df2 = pd.DataFrame([
    {'a': 15, 'b': 13}, 
    {'a': 11, 'b': 22}
])

In [18]:
df1

    a   b
0  15  15
1  12  18

In [19]:
df2

    a   b
0  15  13
1  11  22

In [20]:
# 加法
df = df1.add(df2); df

    a   b
0  30  28
1  23  40

In [21]:
# 減法
df = df1.sub(df2); df

   a  b
0  0  2
1  1 -4

In [22]:
# 乘法
df = df1.mul(df2); df

     a    b
0  225  195
1  132  396

In [23]:
# 除法
df = df1.div(df2); df

          a         b
0  1.000000  1.153846
1  1.090909  0.818182

# 邏輯運算方法
- **gt()**: 大於
- **lt()**: 小於
- **ge()**: 大於等於
- **le()**: 小於等於
- **eq()**: 等於
- **ne()**: 不等於

`註: series 跟 dataframe 都可以用`

In [24]:
# gt(): 大於
df = df1.gt(df2); df

       a      b
0  False   True
1   True  False

In [25]:
# lt(): 小於
df = df1.lt(df2); df

       a      b
0  False  False
1  False   True

In [26]:
# ge(): 大於等於
df = df1.ge(df2); df

      a      b
0  True   True
1  True  False

In [27]:
# le(): 小於等於
df = df1.le(df2); df

       a      b
0   True  False
1  False   True

In [28]:
# eq(): 等於
df = df1.eq(df2); df

       a      b
0   True  False
1  False  False

In [29]:
# ne(): 不等於
df = df1.ne(df2); df

       a     b
0  False  True
1   True  True

# Numpy 也可以用在 Pandas

In [30]:
# 把 df1 所有值平方
df = np.square(df1); df

     a    b
0  225  225
1  144  324

# NaN 的處理
- df.**dropna()**: 將 NaN `刪除`，再回傳新的 series 或 dataframe 物件。
- df.**fillna()**: 將 NaN 由特定的 value `取代`，再回傳新的 series 或 dataframe 物件。
- df.**isna()**: 判斷是否為 NaN，如果`是`，就回傳 True，如果不是，就回傳 False。
- df.**notna()**: 判斷是否為 NaN，如果`不是`，就回傳 True，如果是，就回傳 False。
- df.**isnull()**: 跟 df.**isna()** 一樣。

In [31]:
# 初始化
df = pd.DataFrame([
    [1, 2, 3],
    [4, np.nan, 6],
    [7, 8, np.nan]
]); df

   0    1    2
0  1  2.0  3.0
1  4  NaN  6.0
2  7  8.0  NaN

In [32]:
# isna(): 判斷是否為 NaN，如果是，就回傳 True，如果不是，就回傳 False。
'''
isna() 和 isnull() 是一樣的效果，
主要原因是因為 pandas 的 dataframe 概念，
是基於 R 的 dataframe，
在 R 裡面，na 和 null 是不一樣的東西，
而 pandas 是基於 numpy，
numpy 沒有 na 也沒有 null，只有 nan，
所以 pandas
'''
df.isna()
# isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True

In [33]:
# notna(): 判斷是否為 NaN，如果不是，就回傳 True，如果是，就回傳 False。
df.notna()

      0      1      2
0  True   True   True
1  True  False   True
2  True   True  False

In [34]:
# 在 NaN 的位置上，補上 0
df_ = df.fillna(0); df_.astype('int32')

   0  1  2
0  1  2  3
1  4  0  6
2  7  8  0

In [35]:
# dropna(): 刪除含 NaN 的 row (預設)
df_ = df.dropna(); df_

   0    1    2
0  1  2.0  3.0

In [36]:
# dropna(axis='columns'): 刪除含 NaN 的 column
df_ = df.dropna(axis='columns'); df_

   0
0  1
1  4
2  7

# 簡單的統計函數
- **cummax**(axis=None): 回傳指定軸所累計的最大值。
- **cummin**(axis=None): 回傳指定軸所累計的最小值。 
- **cumsum**(axis=None): 回傳指定軸所累計的總和。
- **max**(axis=None): 回傳指定軸的最大值。
- **min**(axis=None): 回傳指定軸的最小值。
- **sum**(axis=None): 回傳指定軸的總和。
- **mean**(axis=None): 回傳指定軸的平均數。
- **median**(axis=None): 回傳指定軸的中位數。
- **std**(axis=None): 回傳指定軸的標準差。

In [37]:
# 初始化
from random import randint

# dataframe 的 columns
course = ['國文', '英文', '數學', '自然', '社會']

# 各科的分數 (隨機產生)
chinese = [randint(60, 100) for x in range(5)]
english = [randint(60, 100) for x in range(5)]
math = [randint(60, 100) for x in range(5)]
nature = [randint(60, 100) for x in range(5)]
society = [randint(60, 100) for x in range(5)]

# 建立 dataframe
df = pd.DataFrame(
    [chinese, english, math, nature, society], 
    columns=course, 
    index=range(1,6)
); df

   國文  英文  數學  自然  社會
1  84  83  66  91  85
2  98  75  70  88  95
3  72  95  81  64  67
4  84  64  72  82  63
5  92  79  73  76  65

In [38]:
# 累計國文的分數，另外新增一個欄位來放置它
x = df['國文'].cumsum()
df['小計_國文'] = x; df

   國文  英文  數學  自然  社會  小計_國文
1  84  83  66  91  85     84
2  98  75  70  88  95    182
3  72  95  81  64  67    254
4  84  64  72  82  63    338
5  92  79  73  76  65    430

In [39]:
# 補充: 刪除 column 的資料
'''
也可以刪除多個 columns:
df = df.drop(columns=['column_nameA', 'column_nameB'])
'''
df = df.drop('小計_國文', axis=1); df

   國文  英文  數學  自然  社會
1  84  83  66  91  85
2  98  75  70  88  95
3  72  95  81  64  67
4  84  64  72  82  63
5  92  79  73  76  65

In [40]:
# 列出每一個學生的總分，另外新增一個欄位來放置它
total = [df.iloc[i].sum() for i in range(0, 5)]
df['總分'] = total; df

   國文  英文  數學  自然  社會   總分
1  84  83  66  91  85  409
2  98  75  70  88  95  426
3  72  95  81  64  67  379
4  84  64  72  82  63  365
5  92  79  73  76  65  385

In [41]:
# 列出各科平均分數 (包括總分的平均分數)
avg = df.mean(); avg

國文     86.0
英文     79.2
數學     72.4
自然     80.2
社會     75.0
總分    392.8
dtype: float64

In [42]:
# 增加 index: 在 df 下方增加平均分數
df.loc['平均分數'] = avg; df

        國文    英文    數學    自然    社會     總分
1     84.0  83.0  66.0  91.0  85.0  409.0
2     98.0  75.0  70.0  88.0  95.0  426.0
3     72.0  95.0  81.0  64.0  67.0  379.0
4     84.0  64.0  72.0  82.0  63.0  365.0
5     92.0  79.0  73.0  76.0  65.0  385.0
平均分數  86.0  79.2  72.4  80.2  75.0  392.8

In [43]:
# 刪除 index: 刪除 平均分數 的 row
'''
也可以這樣寫:
df = df.drop(index=['平均分數'])
'''
df = df.drop('平均分數', axis=0); df

     國文    英文    數學    自然    社會     總分
1  84.0  83.0  66.0  91.0  85.0  409.0
2  98.0  75.0  70.0  88.0  95.0  426.0
3  72.0  95.0  81.0  64.0  67.0  379.0
4  84.0  64.0  72.0  82.0  63.0  365.0
5  92.0  79.0  73.0  76.0  65.0  385.0

In [44]:
# 排序: 將 dataframe 物件的 總分 欄位，從大排到小
df = df.sort_values(by='總分', ascending=False); df

     國文    英文    數學    自然    社會     總分
2  98.0  75.0  70.0  88.0  95.0  426.0
1  84.0  83.0  66.0  91.0  85.0  409.0
5  92.0  79.0  73.0  76.0  65.0  385.0
3  72.0  95.0  81.0  64.0  67.0  379.0
4  84.0  64.0  72.0  82.0  63.0  365.0

In [45]:
# 經過大到小的排序後，增加名次欄位
rank = range(1, 6)
df['名次'] = rank; df

     國文    英文    數學    自然    社會     總分  名次
2  98.0  75.0  70.0  88.0  95.0  426.0   1
1  84.0  83.0  66.0  91.0  85.0  409.0   2
5  92.0  79.0  73.0  76.0  65.0  385.0   3
3  72.0  95.0  81.0  64.0  67.0  379.0   4
4  84.0  64.0  72.0  82.0  63.0  365.0   5

In [46]:
# 依 index 從新排序
df = df.sort_index(ascending=True); df

     國文    英文    數學    自然    社會     總分  名次
1  84.0  83.0  66.0  91.0  85.0  409.0   2
2  98.0  75.0  70.0  88.0  95.0  426.0   1
3  72.0  95.0  81.0  64.0  67.0  379.0   4
4  84.0  64.0  72.0  82.0  63.0  365.0   5
5  92.0  79.0  73.0  76.0  65.0  385.0   3